set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F2.v}
elaborate F2
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F2.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F2.txt
uplevel #0 { report_area -nosplit } > ../Area/F2.txt
